{"compress":true,"commitItems":[["6423a679-57ef-4fde-9250-9e758f04c3d9",1515439519858,"---\nauthor: \"Jincheng Li\"\ndate: \"2016-07-10T22:12:37-04:00\"\ntitle: What Happens When You Press the Power Button on Your Linux Computer (Draft)\ndraft: false\ntags: [\"linux\", \"booting\", \"assembly\", \"os-series\"]\ndescription: \"I wanted to start a series of posts detailing how the Linux operating system works, more or less like linux-insides, but instead of covering the entire operating system (which is way too much work for my lazy ass), I'll focus on several aspects of the OS\"\n\n---\n\nI wanted to start a series of posts on how the Linux operating system works, inspired by [linux-insides](https://0xax.gitbooks.io/linux-insides/content/), but instead of covering the entire operating system which is way too much work for my lazy ass, I'll focus on several aspects of the OS and try to do a good job explaining them -- I'm hoping to make this comprehensible for someone who's seen some assembly and C, but isn't necessarily familiar with the internals of an OS.\n\nMy motivation for doing this is mainly to learn more about OSes and fill in any knowledge gaps I have. I'm in no way an expert on the topic, so please feel free to correct me if anything here looks inaccurate.\n\nThis first post is going to be about the booting process, from pressing the power button to seeing your desktop background. Booting involves a lot of intricate low-level details and some hardware knowledge, but it's all very fascinating and should be manageable as long as you know some assembly. I will make sure to explain all the terminology along the way.\n\n## Review of Basic Computer Architecture ##\n\nBefore diving into the booting process, let's review some basics about computer architecture. Sometimes I find it easy to lose track of the fundamental building blocks when you are deep into the intricacies of complex systems. Plus I don't think schools necessarily cover all of this in a typical computer science program anymore (or maybe they do but I wasn't paying attention). \n\n![von_neumann](/img/von_neumann.svg)\n\nComputers we use today roughly follow the [von Neumann architecture](https://en.wikipedia.org/wiki/Von_Neumann_architecture) as shown above, with three major components -- CPU, I/O devices, and memory -- connected over [buses](https://en.wikipedia.org/wiki/Bus_(computing)) (wires). The computer works as the CPU executes instructions that either read/write to memory, or interact with I/O devices. The important thing to note here is that from the software perspective, this model is pretty much all there is to a computer. *Every* piece of software eventually gets translated into machine instructions that the CPU carries out, which then interacts with other devices. This includes every piece of software this article covers, and in particular every line of code in the Linux operating system.\n\nSo the CPU communicates with two different types of components: I/O and memory. Correspondingly there are roughly two different types communication channels: the northbridge and the southbridge. These are chipsets that you could see on a motherboard. The northbridge is closer to the CPU and responsible for communications requiring high performance (i.e. memory, and sometimes a video card), while all other devices go through the southbridge.\n\n![motherboard](/img/motherboard.svg)\n\nOkay great, now we know the CPU talks to other components through 'bridges', but how exactly does the communication happen? What data is passed through and what kind of CPU instructions do we use?\n\nThe process is pretty straightforward for reading/writing memory: in this case the CPU simply writes the address it wants to read from / write to to a register, and waits for the memory controller to notice.\n\n<!-- The first step after the computer turns on is executing code stored in the BIOS, but before we dive into that, let's get some basics right. The BIOS is probably not the first thing you think of after hearing the fans start spinning -- usually you might notice a boot screen pop up with a logo of some manufacturer, while at the bottom of the screen there's some text along the lines of \"Press F2 to enter SETUP\". Then before you can read through it, whatever operating system is installed kicks in. So, just to be clear, at this point the computer is already executing BIOS code, which is responsible for putting things on the monitor. But how is it doing that? We are not even running an operating system yet. There is no built-in system calls that you can just use to print text, or show color, or read from disk, etc. -->\n\n<!-- TODO if you are coming back to write this and don't remember what's going on: read wiki on interrupts, software interupts allows CPU to control hardware and hardware interrupts alert CPU. Then there are hardware reserved memory locations to pass around operation paramters for hardware to work with. -->\n\nThis is achieved through [interrupts](https://en.wikipedia.org/wiki/Interrupt).\n\n\n## Pressing [the Button](https://en.wikipedia.org/wiki/The_Button_(Reddit)) ##\n\nButtons are great, especially those that hide incredibly complicated logic behind them to make them almost seem like magic. So what happens when you press the magical power button on a Linux computer?\n\nRecall (or not) that personal computers are composed of a number of components: CPU, BIOS/UEFI, RAM, hard disk, keyboard, mouse, monitor, etc. All of these components are connected through the [motherboard](https://en.wikipedia.org/wiki/Motherboard) -- a large circuit board responsible for transferring data between the different components. If you've ever DIY'd a personal computer, you'd probably know that the process essentially consists of sticking every piece of hardware you bought onto the motherboard and then putting it inside a box.\n\nThe power button, like everything else, is also attached to the motherboard, which in turn is connected to the [power supply unit (PSU)](https://en.wikipedia.org/wiki/Power_supply_unit_(computer)) -- this is usually where you plug your power cord into the computer. When you press the power button, the motherboard sends a signal to the PSU to activate it, providing the motherboard and all other components with proper electricity. As a result of this, all the fans start spinning and whirring, the indication lights turn on, the hard drives and the CPU start running, etc.\n\nSo now we've supplied the different pieces of a computer with electricity. What happens next?\n\n## BIOS ##\n\nThe first piece of code the computer runs after powering on is stored in the [BIOS](https://en.wikipedia.org/wiki/BIOS) firmware. Once the CPU starts, it finds the first instruction to execute at the [Reset vector](https://en.wikipedia.org/wiki/Reset_vector). This is usually just a memory address that's hardcoded as part of the CPU design. For x86 processors, the reset vector is at address `FFFF0h` - 16 bytes below 1MB. This address itself is not an address in the BIOS, but is mapped to some ROM storage unit on the motherboard. The motherboard ensures that this address contains a jump instruction to the BIOS, so as soon as this instruction is executed, BIOS code kicks in.\n\n\n\n## Real Mode ##\n\n## Links ##\n\n",[[1515439519830,["Jincheng@Jinchengs-MacBook-Pro.local",[[-1,12,"\""],[-1,24,"\""],[-1,32,"\""],[1,33,"'"],[-1,58,"\""],[1,59,"'"],[-1,161," [\""],[1,164,"\n  - "],[-1,169,"\", \""],[1,173,"\n  - "],[-1,180,"\", \""],[1,184,"\n  - "],[-1,192,"\", \""],[1,196,"\n  - "],[-1,205,"\"]"],[-1,221,"\""],[1,222,">-\n  "],[1,298,"\n "],[1,373,"\n "],[1,450,"\n "],[-1,476,"\""],[1,478,"style: ocean"]],[5616,6555],[5638,5638]]],[1515439520637,["Jincheng@Jinchengs-MacBook-Pro.local",[[-1,495,"o"],[-1,497,"e"],[1,500,"dy"]],[5638,5638],[5638,5638]]],[1515439521283,["Jincheng@Jinchengs-MacBook-Pro.local",[[-1,488,"style: candy\n"]],[5638,5638],[5625,5625]]],[1515439521819,["Jincheng@Jinchengs-MacBook-Pro.local",[[1,488,"style: ocean\n"]],[5625,5625],[5638,5638]]],[1515439522556,["Jincheng@Jinchengs-MacBook-Pro.local",[[-1,495,"o"],[-1,497,"e"],[1,500,"dy"]],[5638,5638],[5638,5638]]],[1515439522927,["Jincheng@Jinchengs-MacBook-Pro.local",[[1,495,"o"],[1,496,"e"],[-1,498,"dy"]],[5638,5638],[5638,5638]]],[1515439523519,["Jincheng@Jinchengs-MacBook-Pro.local",[[-1,495,"ocea"],[1,499,"plai"]],[5638,5638],[5638,5638]]],[1515439524105,["Jincheng@Jinchengs-MacBook-Pro.local",[[-1,495,"plain"],[1,500,"candy"]],[5638,5638],[5638,5638]]]]]]}